#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <ctype.h>

/*ЗАДАНИЕ 4

Написать функции, вычисляющие периметр и площадь треугольника по значениям длин трёх его сторон. 
Разместить их в отдельном модуле (отличном от того, где располагается функция main( )). 
Ввести с консоли значения длин сторон треугольника (с проверкой на корректность неравенства треугольника) 
и выдать на консоль вычисленные с помощью написанных функций значения его периметра и площади.*/


int main(int argc, char *argv[]){

    return 0;
}